x, y = map(float, input("введіть координати точки (x y): ").split())

if x > 0 and y > 0:
    print("точка знаходиться в І чверті.")
elif x < 0 and y > 0:
    print("точка знаходиться в ІІ чверті.")
elif x < 0 and y < 0:
    print("точка знаходиться в ІІІ чверті.")
elif x > 0 and y < 0:
    print("точка знаходиться в IV чверті.")
elif x == 0 and y == 0:
    print("точка знаходиться в початку координат.")
elif x == 0:
    print("точка знаходиться на осі Y.")
elif y == 0:
    print("точка знаходиться на осі X.")
